In [1]:
import duckdb as dd

In [2]:
con = dd.connect("data.db")

In [3]:
con.execute(
    """
WITH duplicates AS (
  SELECT 
    service_name,
    count(*) as counter
  FROM 
    Service
  GROUP BY service_name
  HAVING counter > 1
)
SELECT s.costs_per_month, s.service_id, d.counter FROM SERVICE s
JOIN duplicates d ON d.service_name = s.service_name  
"""
).df()

   costs_per_month  service_id  counter
0             9.99           2        2
1            59.99         999        2

In [4]:
con.execute(
"""
WITH duplicates AS (
  SELECT
  ROW_NUMBER() OVER (PARTITION BY Service_name) as counter,
  service_name
  FROM Service
) SELECT * FROM duplicates WHERE counter > 1
"""
).df()

   counter service_name
0        2    Databases

In [5]:
con.execute("select * from Service").df()
# con.execute("update Service set service_id = 999 where costs_per_month = 59.99;")

   service_id        service_name  costs_per_month
0           1           Streaming            19.99
1           2           Databases             9.99
2           3  Custom Development           199.99
3           4          Automation            89.99
4           5            Hardware            12.69
5           6          E-Commerce            39.99
6           7          Bi Tooling             8.99
7         999           Databases            59.99

### Diagramme
Erstellen von Diagrammen über die verfügbaren Daten

In [8]:
# !pip install matplotlib
# !pip install plotly